src/cfe/InformationRegisters/OData4_КэшМетаданных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>OData4_КэшМетаданных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Среда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Записан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/CommonModules/OData4_КэшМетаданных/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Кэш готовых документов $metadata между сеансами (этап 8.3): регистр сведений OData4_КэшМетаданных, запись на
// документ (вид XML или JSON) по ключу КлючЗаписи. Включается флажком настроек КэшМетаданных.
//
// Ключ записи — SHA-256 от трёх частей, каждая из которых меняет документ:
// - ключ документов сеанса (OData4_МодельПовтИсп.КлючДокументов): состав публикации, версия настроек, режим
//   «Привилегированный», профиль с версией его данных;
// - отпечаток индекса модели (ОтпечатокИндекса): имена наборов, объекты и виды — то, что видит этот пользователь
//   (объекты без права «Чтение» в модель не входят), поэтому пользователи с разными правами получают разные записи;
// - отпечаток среды (ОтпечатокСреды): версия платформы, конфигурация (имя, версия и обход метаданных — имена и типы
//   всех полей, свойства объектов, которые читает модель) и все расширения (имя, хеш-сумма, безопасный режим).
//   Платформа не даёт хеш-суммы основной конфигурации (только расширений, РасширениеКонфигурации.ХешСумма), а
//   ПолучитьИдентификаторКонфигурации случаен и стоит ~1,3 с (проба 8.3), поэтому конфигурация — обходом.
//
// Безопасность: регистр читается и пишется в привилегированном режиме (у пользователя сервиса может не быть ролей
// OData4). Документ определяется ключом полностью: запись с тем же ключом строится из того же состава, настроек,
// профиля, набора доступных объектов и тех же метаданных, то есть пользователь получает ровно тот документ, который
// построил бы сам. Данных информационной базы в документе нет — только метаданные, видимые этому пользователю.
//
// Вытеснение: при записи удаляются записи другой среды (изменилась конфигурация, расширение или платформа) и сверх
// НаибольшееЧислоЗаписей самые старые. Сбой чтения или записи регистра (нет таблицы на границе простоя сеанса, см.
// OData4_Движок.НастройкиДвижка) запрос не роняет: документ строится как без кэша, запись — предупреждение в журнале
// регистрации (событие OData4.КэшМетаданных).

// Кэш между сеансами включён (флажок настроек КэшМетаданных).
Функция Включён() Экспорт
	Возврат OData4_НастройкиСервиса.Значение("КэшМетаданных", Истина) = Истина;
КонецФункции

// Ключ записи кэша для ключа документов сеанса КлючДокументов и модели Модель (полная модель состава сеанса —
// OData4_МодельПовтИсп.ПолнаяМодель, нужен только её индекс).
Функция КлючЗаписи(КлючДокументов, Модель) Экспорт
	Хеш = Новый ХешированиеДанных(ХешФункция.SHA256);
	Хеш.Добавить(КлючДокументов + Символы.ПС + ОтпечатокСреды() + Символы.ПС + ОтпечатокИндекса(Модель));
	Возврат НРег(ПолучитьHexСтрокуИзДвоичныхДанных(Хеш.ХешСумма));
КонецФункции

// Типы менеджера и набора записей регистра кэша определены в этом сеансе: проверка перехватываемая, а создание набора
// записей в сеансе без типов расширения (гонка начала сеанса HTTP-сервиса, ИО-1) — неперехватываемый ответ 500
// «Тип не определен», даже если запрос к таблице прошёл (Go-приёмка этапа 8). Перед OData4_КэшМетаданныхЗапись.
Функция ЗаписьДоступна() Экспорт
	Попытка
		Менеджер = Тип("РегистрСведенийМенеджер.OData4_КэшМетаданных");
		Набор = Тип("РегистрСведенийНаборЗаписей.OData4_КэшМетаданных");
	Исключение
		Возврат Ложь;
	КонецПопытки;
	Возврат Менеджер <> Неопределено И Набор <> Неопределено;
КонецФункции

// Документ вида Вид ("XML" или "JSON") по ключу записи или Неопределено (нет записи, сбой чтения).
// ТаблицаДоступна (необязательный, по ссылке) получает Истина, если запрос к регистру выполнился: только тогда
// вызывающий пишет в кэш (см. OData4_МодельПовтИсп.ДокументМетаданных).
Функция Прочитать(КлючЗаписи, Вид, ТаблицаДоступна = Ложь) Экспорт
	ТаблицаДоступна = Ложь;
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
			|	К.Документ КАК Документ
			|ИЗ
			|	РегистрСведений.OData4_КэшМетаданных КАК К
			|ГДЕ
			|	К.Ключ = &Ключ
			|	И К.Вид = &Вид");
		Запрос.УстановитьПараметр("Ключ", КлючЗаписи);
		Запрос.УстановитьПараметр("Вид", Вид);
		Выборка = Запрос.Выполнить().Выбрать();
		ТаблицаДоступна = Истина;
		Документ = Неопределено;
		Если Выборка.Следующий() Тогда
			Документ = Выборка.Документ.Получить();
		КонецЕсли;
	Исключение
		УстановитьПривилегированныйРежим(Ложь);
		ЗаписьЖурналаРегистрации("OData4.КэшМетаданных", УровеньЖурналаРегистрации.Предупреждение, , ,
			"Кэш $metadata не прочитан, документ строится заново: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;
	УстановитьПривилегированныйРежим(Ложь);
	Возврат ?(ТипЗнч(Документ) = Тип("Строка"), Документ, Неопределено);
КонецФункции

// Сколько записей держит кэш: документы разных составов, профилей и наборов прав живут одновременно, остальные
// вытесняются по давности записи.
Функция НаибольшееЧислоЗаписей() Экспорт
	Возврат 20;
КонецФункции

// Отпечаток среды: версия платформы, конфигурация (ОтпечатокКонфигурации) и расширения. Один раз на сеанс: изменения
// конфигурации и расширений действуют только в новых сеансах. Настройка ПроверкаКонфигурации «ПоВерсии» — без обхода
// метаданных (ОтпечатокКонфигурации, ~0,3 с): конфигурация — только имя, версия и режим совместимости, так что её
// изменение без смены номера версии этот отпечаток не меняет. Отпечаток служит и ключу словаря выдачи
// (OData4_ВыдачаNative.КлючСловаря).
Функция ОтпечатокСреды() Экспорт
	Память = OData4_МодельКэш.ПамятьСеанса();
	Отпечаток = Память.Получить("ОтпечатокСреды");
	Если Отпечаток <> Неопределено Тогда
		Возврат Отпечаток;
	КонецЕсли;
	Информация = Новый СистемнаяИнформация;
	Части = Новый Массив;
	Части.Добавить(Информация.ВерсияПриложения);
	Части.Добавить(Метаданные.Имя + "|" + Метаданные.Версия + "|" + Строка(Метаданные.РежимСовместимости));
	Если OData4_НастройкиСервиса.Значение("ПроверкаКонфигурации", "Полная") = "ПоВерсии" Тогда
		Части.Добавить("ПоВерсии");
	Иначе
		Части.Добавить(ОтпечатокКонфигурации());
	КонецЕсли;
	// Список расширений доступен только с административными правами: у пользователя сервиса их обычно нет.
	УстановитьПривилегированныйРежим(Истина);
	Расширения = РасширенияКонфигурации.Получить();
	УстановитьПривилегированныйРежим(Ложь);
	Для Каждого Расширение Из Расширения Цикл
		Сумма = Расширение.ХешСумма;
		Части.Добавить(Расширение.Имя + "|" + Расширение.Версия + "|" + Строка(Расширение.БезопасныйРежим) + "|"
			+ ?(ТипЗнч(Сумма) = Тип("ДвоичныеДанные"), ПолучитьHexСтрокуИзДвоичныхДанных(Сумма), Строка(Сумма)));
	КонецЦикла;
	Хеш = Новый ХешированиеДанных(ХешФункция.SHA256);
	Хеш.Добавить(СтрСоединить(Части, Символы.ПС));
	Отпечаток = НРег(ПолучитьHexСтрокуИзДвоичныхДанных(Хеш.ХешСумма));
	Память.Вставить("ОтпечатокСреды", Отпечаток);
	Возврат Отпечаток;
КонецФункции

// Отпечаток метаданных конфигурации (с расширениями — в сеансе метаданные уже с ними): для объектов всех видов,
// которые читает модель, — полное имя, свойства объекта из СвойстваОбъекта (длины кода и номера, иерархия, вид и
// периодичность регистра, план счетов и субконто…), имена и типы (ОписаниеТипов с квалификаторами) всех полей:
// стандартных реквизитов, реквизитов, измерений, ресурсов, табличных частей, признаков учёта, реквизитов адресации,
// граф журналов, значения перечислений, типы констант и общих реквизитов с их составом. Свойство метаданных, которое
// начнёт читать модель, дописывается в СвойстваОбъекта.
Функция ОтпечатокКонфигурации() Экспорт
	Части = Новый Массив;
	Типы = Новый Массив;
	Свойства = Новый Структура(СвойстваОбъекта());
	Для Каждого Коллекция Из СтрРазделить("Справочники,Документы,ПланыВидовХарактеристик,ПланыСчетов,"
		+ "ПланыВидовРасчета,БизнесПроцессы,Задачи,ПланыОбмена", ",") Цикл
		Для Каждого Объект Из Метаданные[Коллекция] Цикл
			ДобавитьОбъект(Части, Свойства, Объект);
			ДобавитьПоля(Части, Типы, Объект.СтандартныеРеквизиты);
			ДобавитьПоля(Части, Типы, Объект.Реквизиты);
			Для Каждого ТабличнаяЧасть Из Объект.ТабличныеЧасти Цикл
				Части.Добавить("ТЧ " + ТабличнаяЧасть.Имя);
				ДобавитьПоля(Части, Типы, ТабличнаяЧасть.СтандартныеРеквизиты);
				ДобавитьПоля(Части, Типы, ТабличнаяЧасть.Реквизиты);
			КонецЦикла;
			Если Коллекция = "ПланыСчетов" Тогда
				ДобавитьПоля(Части, Типы, Объект.ПризнакиУчета);
				ДобавитьПоля(Части, Типы, Объект.ПризнакиУчетаСубконто);
			ИначеЕсли Коллекция = "Задачи" Тогда
				ДобавитьПоля(Части, Типы, Объект.РеквизитыАдресации);
			КонецЕсли;
			Если Коллекция = "ПланыСчетов" Или Коллекция = "ПланыВидовРасчета" Тогда
				Для Каждого ТабличнаяЧасть Из Объект.СтандартныеТабличныеЧасти Цикл
					Части.Добавить("СТЧ " + ТабличнаяЧасть.Имя);
					ДобавитьПоля(Части, Типы, ТабличнаяЧасть.СтандартныеРеквизиты);
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Для Каждого Коллекция Из СтрРазделить("РегистрыСведений,РегистрыНакопления,РегистрыБухгалтерии,РегистрыРасчета", ",") Цикл
		Для Каждого Объект Из Метаданные[Коллекция] Цикл
			ДобавитьОбъект(Части, Свойства, Объект);
			ДобавитьПоля(Части, Типы, Объект.СтандартныеРеквизиты);
			ДобавитьПоля(Части, Типы, Объект.Измерения);
			ДобавитьПоля(Части, Типы, Объект.Ресурсы);
			ДобавитьПоля(Части, Типы, Объект.Реквизиты);
		КонецЦикла;
	КонецЦикла;
	Для Каждого Объект Из Метаданные.ЖурналыДокументов Цикл
		ДобавитьОбъект(Части, Свойства, Объект);
		ДобавитьПоля(Части, Типы, Объект.СтандартныеРеквизиты);
		Для Каждого Графа Из Объект.Графы Цикл
			Части.Добавить("Графа " + Графа.Имя);
			Для Каждого Ссылка Из Графа.Ссылки Цикл
				Части.Добавить(Ссылка.ПолноеИмя());
			КонецЦикла;
		КонецЦикла;
		Для Каждого Документ Из Объект.РегистрируемыеДокументы Цикл
			Части.Добавить(Документ.ПолноеИмя());
		КонецЦикла;
	КонецЦикла;
	Для Каждого Объект Из Метаданные.Перечисления Цикл
		Части.Добавить(Объект.ПолноеИмя());
		Для Каждого Значение Из Объект.ЗначенияПеречисления Цикл
			Части.Добавить(Значение.Имя);
		КонецЦикла;
	КонецЦикла;
	Для Каждого Объект Из Метаданные.Константы Цикл
		Части.Добавить(Объект.ПолноеИмя());
		Типы.Добавить(Объект.Тип);
	КонецЦикла;
	Для Каждого Объект Из Метаданные.ОбщиеРеквизиты Цикл
		ДобавитьОбъект(Части, Свойства, Объект);
		Типы.Добавить(Объект.Тип);
		Для Каждого Элемент Из Объект.Состав Цикл
			Части.Добавить(Элемент.Метаданные.ПолноеИмя() + "=" + Строка(Элемент.Использование));
		КонецЦикла;
	КонецЦикла;
	Хеш = Новый ХешированиеДанных(ХешФункция.SHA256);
	Хеш.Добавить(СтрСоединить(Части, Символы.ПС));
	Хеш.Добавить(ЗначениеВСтрокуВнутр(Типы));
	Возврат НРег(ПолучитьHexСтрокуИзДвоичныхДанных(Хеш.ХешСумма));
КонецФункции

// Отпечаток индекса модели Модель: наборы в порядке модели с объектом, видом и именем в владельце.
Функция ОтпечатокИндекса(Модель) Экспорт
	Части = Новый Массив;
	Для Каждого Имя Из Модель.Порядок Цикл
		Запись = OData4_Модель.СведенияНабора(Модель, Имя);
		Если Запись = Неопределено Тогда
			Части.Добавить(Имя);
		Иначе
			Части.Добавить(Имя + "|" + Запись.Объект + "|" + Запись.Вид + "|" + Запись.ИмяВВладельце);
		КонецЕсли;
	КонецЦикла;
	Хеш = Новый ХешированиеДанных(ХешФункция.SHA256);
	Хеш.Добавить(СтрСоединить(Части, Символы.ПС));
	Возврат НРег(ПолучитьHexСтрокуИзДвоичныхДанных(Хеш.ХешСумма));
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Свойства объектов метаданных, от которых зависит модель (имена через запятую; у объекта без свойства оно
// остаётся пустым — ЗаполнитьЗначенияСвойств пропускает отсутствующие).
Функция СвойстваОбъекта()
	Возврат "Иерархический,ВидИерархии,ДлинаКода,ДлинаНаименования,ТипКода,ДлинаНомера,ТипНомера,Проведение,"
		+ "ПериодичностьРегистраСведений,РежимЗаписи,ВидРегистра,Корреспонденция,МаксКоличествоСубконто,ПланСчетов,"
		+ "ВидыСубконто,ИспользованиеПериодаДействия,ЗависимостьОтВидовРасчета,ПланВидовРасчета,Периодичность,"
		+ "АвтоИспользование,РазделениеДанных,ИспользованиеРазделяемыхДанных,ДлинаКодаОтправителя";
КонецФункции

Процедура ДобавитьОбъект(Части, Свойства, Объект)
	Для Каждого КлючИЗначение Из Свойства Цикл
		Свойства[КлючИЗначение.Ключ] = Неопределено;
	КонецЦикла;
	ЗаполнитьЗначенияСвойств(Свойства, Объект);
	Значения = Новый Массив;
	Значения.Добавить(Объект.ПолноеИмя());
	Для Каждого КлючИЗначение Из Свойства Цикл
		Значения.Добавить(ПредставлениеСвойства(КлючИЗначение.Значение));
	КонецЦикла;
	Части.Добавить(СтрСоединить(Значения, "|"));
КонецПроцедуры

// Значение свойства объекта метаданных строкой: объект метаданных — полным именем, прочее (числа, Булево, значения
// системных перечислений) — Строка. Свойств-коллекций в СвойстваОбъекта нет (владельцы справочника, например,
// видны в типе стандартного реквизита Владелец).
Функция ПредставлениеСвойства(Значение)
	Если Значение = Неопределено Тогда
		Возврат "";
	ИначеЕсли ТипЗнч(Значение) = Тип("ОбъектМетаданных") Тогда
		Возврат Значение.ПолноеИмя();
	КонецЕсли;
	Возврат Строка(Значение);
КонецФункции

Процедура ДобавитьПоля(Части, Типы, Поля)
	Для Каждого Поле Из Поля Цикл
		Части.Добавить(Поле.Имя);
		Типы.Добавить(Поле.Тип);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
